In [4]:
import pandas as pd

In [5]:
titles = pd.read_csv('C:/Users/vishal/Desktop/letsupgrade/pandas/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [6]:
titles

                                      title  year
0                        Tasveer Mere Sanam  1996
1                                  Only You  1994
2                      El pueblo del terror  1970
3                                   Machine  2007
4                                      MARy  2008
...                                     ...   ...
244909  Black Butterfly in a Colorful World  2018
244910        Hua fei hua wu chun man cheng  1980
244911                 Nippon dabi katsukyu  1970
244912        Under Siege 2: Dark Territory  1995
244913            She Must Be Seeing Things  1987

[244914 rows x 2 columns]

In [7]:
titles.tail()

                                      title  year
244909  Black Butterfly in a Colorful World  2018
244910        Hua fei hua wu chun man cheng  1980
244911                 Nippon dabi katsukyu  1970
244912        Under Siege 2: Dark Territory  1995
244913            She Must Be Seeing Things  1987

In [8]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244914 entries, 0 to 244913
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   244914 non-null  object
 1   year    244914 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.7+ MB

In [9]:
titles.describe().T

         count         mean        std     min     25%     50%     75%     max
year  244914.0  1986.616012  29.459912  1894.0  1967.0  1997.0  2012.0  2115.0

In [10]:
titles.shape

(244914, 2)

In [11]:
titles.size

489828

In [12]:
titles.count()

title    244914
year     244914
dtype: int64

In [13]:
titles.columns

Index(['title', 'year'], dtype='object')

In [67]:
titles.isna().sum()

title    0
year     0
dtype: int64

### How many movies are listed in the titles dataframe?

In [15]:
titles.head(2)

                title  year
0  Tasveer Mere Sanam  1996
1            Only You  1994

In [16]:
titles['title'].count()

244914

### What are the earliest two films listed in the titles dataframe?

In [17]:
titles[titles.year == 2020].head(2)

                   title  year
98       Bread in Heaven  2020
1992  Dante's Inferno 3D  2020

### How many movies have the title "Hamlet"?

In [18]:
titles[titles.title == 'Hamlet'].head()

        title  year
6422   Hamlet  2017
10637  Hamlet  1921
39916  Hamlet  1913
52521  Hamlet  1910
62000  Hamlet  2000

In [19]:
titles[titles.title == 'Hamlet'].title.count()

20

### How many movies are titled "North by Northwest"?

In [20]:
titles[titles.title == 'North by Northwest']

                    title  year
74398  North by Northwest  1959

In [21]:
titles[titles.title == 'North by Northwest'].title.count()

1

### When was the first movie titled "Hamlet" made?

In [22]:
titles[titles.title == 'Hamlet'].year.min()

1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [23]:
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [24]:
titles[titles.title == 'Treasure Island']

                  title  year
27076   Treasure Island  1999
37238   Treasure Island  1973
55686   Treasure Island  1918
65051   Treasure Island  1972
77354   Treasure Island  1950
141822  Treasure Island  1934
173051  Treasure Island  1985
196514  Treasure Island  1920

### How many movies were made in the year 1950?

In [25]:
titles[titles.year == 1950].year.count()

1113

### How many movies were made in the year 1960?

In [26]:
titles[titles.year == 1960].year.count()

1549

### How many movies were made from 1950 through 1959?

In [27]:
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [28]:
l = [i for i in list(titles[titles.year >= 1950].year) if i<= 1959]
len(l)

12934

In [29]:
a = list(filter(lambda year:(year>=1950)and(year<=1959), list(titles.year)))
len(a)

12934

### In what years has a movie titled "Batman" been released?

In [30]:
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [31]:
titles[titles.title == 'Batman'].year.min()

1943

### reslease_dates file

In [32]:
rs = pd.read_csv('C:/Users/vishal/Desktop/letsupgrade/pandas/release_dates.csv')

In [33]:
rs.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

In [34]:
rs.shape

(479488, 4)

In [35]:
rs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 479488 entries, 0 to 479487
Data columns (total 4 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   title    479488 non-null  object
 1   year     479488 non-null  int64
 2   country  479488 non-null  object
 3   date     479488 non-null  object
dtypes: int64(1), object(3)
memory usage: 14.6+ MB

In [36]:
rs.describe().T

         count         mean        std     min     25%     50%     75%     max
year  479488.0  1986.524783  28.015756  1894.0  1966.0  1998.0  2010.0  2115.0

In [37]:
rs.isna().sum()

title      0
year       0
country    0
date       0
dtype: int64

### cast csv file

In [38]:
cast = pd.read_csv('C:/Users/vishal/Desktop/letsupgrade/pandas/cast.csv')

In [39]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [40]:
cast.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3786176 entries, 0 to 3786175
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   title      object
 1   year       int64
 2   name       object
 3   type       object
 4   character  object
 5   n          float64
dtypes: float64(1), int64(1), object(4)
memory usage: 173.3+ MB

In [41]:
cast.shape

(3786176, 6)

In [42]:
cast.describe().T

,count,mean,std,min,25%,50%,75%,max
year,3786176.0,1988.910769,27.892251,1894.0,1970.0,2001.0,2012.0,2115.0
n,2327603.0,16.905993,31.706789,1.0,5.0,10.0,21.0,33613.0

In [43]:
cast.isna().sum().sum()

1458573

### How many roles were there in the movie "Inception"?

In [44]:
cast.head(2)

             title  year      name   type character     n
0   Closet Monster  2015  Buffy #1  actor   Buffy 4  31.0
1  Suuri illusioni  1985    Homo $  actor    Guests  22.0

In [45]:
cast[cast.title == 'Inception'].character.count()

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [70]:
cast[cast.title == 'Inception'].n.isna().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [71]:
cast[cast.title == 'Inception'].n.count()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [72]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [79]:
cast[cast.title == 'North by Northwest'].n.sort_values()

871426     1.0
3518333    2.0
1457165    3.0
3157232    4.0
356707     5.0
          ...
3441077    NaN
3577128    NaN
3599912    NaN
3739133    NaN
3751311    NaN
Name: n, Length: 116, dtype: float64

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [77]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [102]:
cast1 = cast[cast.title == 'Sleuth']
cast1[cast1.year == 1972]

,title,year,name,type,character,n
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [106]:
cast1 = cast[cast.title == 'Sleuth']
cast1[cast1.year == 2007]

          title  year                 name     type          character    n
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [110]:
cast1 = cast[cast.title == 'Hamlet']
cast1[cast1.year == 1921].character.count()

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [114]:
cast1 = cast[cast.title == 'Hamlet']
cast2 = cast1[cast1.year == 1996]
cast2[cast2.name == 'Kenneth Branagh'].name.count()

1

### How many "Hamlet" roles have been listed in all film credits through history?

In [115]:
cast[cast.title == 'Hamlet'].name.count()

342

### How many people have played an "Ophelia"?

In [119]:
cast[cast.title == 'Ophelia'].name.count()

20

### How many people have played a role called "The Dude"?

In [124]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [130]:
cast[cast.character == 'The Dude'].name.count()

19

### How many people have played a role called "The Stranger"?

In [134]:
cast[cast.character == 'The Stranger'].name.count()

212

### How many roles has Sidney Poitier played throughout his career?

In [142]:
cast[cast.name == 'Sidney Poitier'].name.count()

43

### How many roles has Judi Dench played?

In [139]:
cast[cast.name == 'Judi Dench'].name.count()

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [161]:
cast1 = cast[cast.name == 'Cary Grant']
cast2 = cast1[cast1.year == 1940]
cast2[cast2.n == 2.0]

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [180]:
cast1 = cast[cast.name == 'Cary Grant']
cast2 = cast1[cast1.year == 1940]
cast2[cast2.n == 1.0]

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s?

In [168]:
cast1 = cast[cast.type == 'actor']
cast1[cast1.year == 1950].year.count()

16760

### How many roles were available for actresses in the 1950s?

In [175]:
cast1 = cast[cast.type == 'actress']
cast1[cast1.year == 1950].year.count()

5637

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [178]:
cast1 = cast[cast.year == 1980]
cast1[cast1.n == 1.0].year.count()

1183

### How many non-leading roles were available through from the beginning of film history through 1980?

In [185]:
cast1 = cast[cast.year == 1980]
cast1[cast1.n == 2.0].n.count()

1088

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [198]:
cast[cast.year == 1980].n.isna().sum()

4466